In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

## Pandas Series

In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a','b','c','d']
myList = [1,2,3,4]
myDict = {1:'a', 2:'b',3:'c'}

In [4]:
pd.Series(data = myList)   # for series

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
ser = pd.Series(data = myList, index = labels)
ser

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
ser1 = pd.Series(data = myDict)

In [7]:
ser1

1    a
2    b
3    c
dtype: object

In [8]:
ser[3]

4

In [9]:
ser['d']

4

## Pandas Dataframe

In [10]:
pd.DataFrame(data = np.random.randn(5,4))

          0         1         2         3
0 -0.487842  1.031796  0.800898 -2.335721
1 -0.496768  0.791005 -0.259844  0.471484
2 -0.027648 -0.965641  1.093917 -1.902616
3 -0.210356 -0.628087 -0.383829  1.776477
4  0.963049 -0.630247  0.693331 -0.921813

In [11]:
pd.DataFrame(data = np.random.randn(5,4), index= ['a','b','c','d','e'])

          0         1         2         3
a  0.824843  0.378038 -1.955747  0.195013
b  0.277590  1.695011 -0.338128  1.632311
c  1.699269 -1.294710 -0.137551  0.602134
d -0.762742 -0.264173 -1.890239  0.630911
e -0.820010 -0.481344  0.560790  0.728390

In [12]:
df = pd.DataFrame(data = np.random.randn(5,4), index = ['a','b','c','d','e'], columns = ['w','x','y','z'])
df

          w         x         y         z
a  0.488526 -0.877242 -1.397761 -1.627774
b  0.836359  0.219838  0.555419 -0.778284
c -0.346862 -1.016728  0.374469  0.945023
d -1.443927 -0.421829 -0.424472  0.086304
e  0.349116 -1.598392  0.021957 -0.922505

In [13]:
df['x']

a   -0.877242
b    0.219838
c   -1.016728
d   -0.421829
e   -1.598392
Name: x, dtype: float64

In [14]:
df['y']

a   -1.397761
b    0.555419
c    0.374469
d   -0.424472
e    0.021957
Name: y, dtype: float64

In [15]:
df[['w','z']]

          w         z
a  0.488526 -1.627774
b  0.836359 -0.778284
c -0.346862  0.945023
d -1.443927  0.086304
e  0.349116 -0.922505

In [16]:
df['new_column'] = df['w'] + df['z']

In [17]:
df

          w         x         y         z  new_column
a  0.488526 -0.877242 -1.397761 -1.627774   -1.139248
b  0.836359  0.219838  0.555419 -0.778284    0.058075
c -0.346862 -1.016728  0.374469  0.945023    0.598162
d -1.443927 -0.421829 -0.424472  0.086304   -1.357623
e  0.349116 -1.598392  0.021957 -0.922505   -0.573389

In [18]:
df['new_column'] = [0,2,3,7,5]

In [19]:
df

          w         x         y         z  new_column
a  0.488526 -0.877242 -1.397761 -1.627774           0
b  0.836359  0.219838  0.555419 -0.778284           2
c -0.346862 -1.016728  0.374469  0.945023           3
d -1.443927 -0.421829 -0.424472  0.086304           7
e  0.349116 -1.598392  0.021957 -0.922505           5

In [20]:
df.shape

(5, 5)

In [21]:
df.drop('new_column', axis=1)

          w         x         y         z
a  0.488526 -0.877242 -1.397761 -1.627774
b  0.836359  0.219838  0.555419 -0.778284
c -0.346862 -1.016728  0.374469  0.945023
d -1.443927 -0.421829 -0.424472  0.086304
e  0.349116 -1.598392  0.021957 -0.922505

In [22]:
df              # adding data is inplace  but dropping data is not in place

          w         x         y         z  new_column
a  0.488526 -0.877242 -1.397761 -1.627774           0
b  0.836359  0.219838  0.555419 -0.778284           2
c -0.346862 -1.016728  0.374469  0.945023           3
d -1.443927 -0.421829 -0.424472  0.086304           7
e  0.349116 -1.598392  0.021957 -0.922505           5

In [23]:
df.drop('new_column', axis =1, inplace = True)

In [24]:
df

          w         x         y         z
a  0.488526 -0.877242 -1.397761 -1.627774
b  0.836359  0.219838  0.555419 -0.778284
c -0.346862 -1.016728  0.374469  0.945023
d -1.443927 -0.421829 -0.424472  0.086304
e  0.349116 -1.598392  0.021957 -0.922505

In [25]:
df.loc['a']          # gives all values of a row/index.

w    0.488526
x   -0.877242
y   -1.397761
z   -1.627774
Name: a, dtype: float64

In [26]:
df.iloc[2]           # gives all values of a row/index and it takes index of row.

w   -0.346862
x   -1.016728
y    0.374469
z    0.945023
Name: c, dtype: float64

In [27]:
df.loc['d']

w   -1.443927
x   -0.421829
y   -0.424472
z    0.086304
Name: d, dtype: float64

In [28]:
df.loc[['a','b'], ['w','z']]

          w         z
a  0.488526 -1.627774
b  0.836359 -0.778284

In [29]:
df['w']>0

a     True
b     True
c    False
d    False
e     True
Name: w, dtype: bool

In [30]:
df[df['w']>0]       # print those which are true

          w         x         y         z
a  0.488526 -0.877242 -1.397761 -1.627774
b  0.836359  0.219838  0.555419 -0.778284
e  0.349116 -1.598392  0.021957 -0.922505

In [31]:
df[df['w']>0]['x']

a   -0.877242
b    0.219838
e   -1.598392
Name: x, dtype: float64

In [32]:
df['new'] = ['A','B','C','D','E']

In [33]:
df

          w         x         y         z new
a  0.488526 -0.877242 -1.397761 -1.627774   A
b  0.836359  0.219838  0.555419 -0.778284   B
c -0.346862 -1.016728  0.374469  0.945023   C
d -1.443927 -0.421829 -0.424472  0.086304   D
e  0.349116 -1.598392  0.021957 -0.922505   E

In [34]:
df.set_index('new') # as old indexes are getting deleted , this command is not inplace by default.

            w         x         y         z
new
A    0.488526 -0.877242 -1.397761 -1.627774
B    0.836359  0.219838  0.555419 -0.778284
C   -0.346862 -1.016728  0.374469  0.945023
D   -1.443927 -0.421829 -0.424472  0.086304
E    0.349116 -1.598392  0.021957 -0.922505

In [35]:
df

          w         x         y         z new
a  0.488526 -0.877242 -1.397761 -1.627774   A
b  0.836359  0.219838  0.555419 -0.778284   B
c -0.346862 -1.016728  0.374469  0.945023   C
d -1.443927 -0.421829 -0.424472  0.086304   D
e  0.349116 -1.598392  0.021957 -0.922505   E

In [36]:
df.set_index('new', inplace = True)

In [37]:
df

            w         x         y         z
new
A    0.488526 -0.877242 -1.397761 -1.627774
B    0.836359  0.219838  0.555419 -0.778284
C   -0.346862 -1.016728  0.374469  0.945023
D   -1.443927 -0.421829 -0.424472  0.086304
E    0.349116 -1.598392  0.021957 -0.922505

## Groupby

In [38]:
data = {'Employee_Company':['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FACEBOOK','FACEBOOK'],'employee_id':['P1','P2','P3','P4','P5','P6'],'Salary':[4500,5500,6500,3400,2300,1200]}

In [39]:
df = pd.DataFrame(data)
df

  Employee_Company employee_id  Salary
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

In [40]:
df.sum()

Employee_Company    GOOGLEGOOGLEMICROSOFTMICROSOFTFACEBOOKFACEBOOK
employee_id                                           P1P2P3P4P5P6
Salary                                                       23400
dtype: object

In [41]:
df.groupby('Employee_Company').max()

                 employee_id  Salary
Employee_Company
FACEBOOK                  P6    2300
GOOGLE                    P2    5500
MICROSOFT                 P4    6500

In [42]:
df.groupby('Employee_Company').sum()

                  Salary
Employee_Company
FACEBOOK            3500
GOOGLE             10000
MICROSOFT           9900

In [43]:
df.describe()

            Salary
count     6.000000
mean   3900.000000
std    1988.969582
min    1200.000000
25%    2575.000000
50%    3950.000000
75%    5250.000000
max    6500.000000

In [44]:
df.groupby('Employee_Company').describe()

                 Salary                                                       \
                  count    mean          std     min     25%     50%     75%
Employee_Company
FACEBOOK            2.0  1750.0   777.817459  1200.0  1475.0  1750.0  2025.0
GOOGLE              2.0  5000.0   707.106781  4500.0  4750.0  5000.0  5250.0
MICROSOFT           2.0  4950.0  2192.031022  3400.0  4175.0  4950.0  5725.0


                     max
Employee_Company
FACEBOOK          2300.0
GOOGLE            5500.0
MICROSOFT         6500.0

# Concatination:

In [45]:
# concat syntax  pd.concat(first dataFrame, 2nd dataFrame, Index):

In [55]:
pd.concat([df, pd.DataFrame({'Employee_Company':'AMAZON','employee_id':'P7','Salary':6700}, index=[6]) ])

  Employee_Company employee_id  Salary
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200
6           AMAZON          P7    6700

In [65]:
df = pd.concat([df, pd.DataFrame([1,2,3,4,5,6],columns= ['Number'])],axis =1)  # ran comd twice for two number columns
df

  Employee_Company employee_id  Salary  Number  Number
0           GOOGLE          P1    4500       1       1
1           GOOGLE          P2    5500       2       2
2        MICROSOFT          P3    6500       3       3
3        MICROSOFT          P4    3400       4       4
4         FACEBOOK          P5    2300       5       5
5         FACEBOOK          P6    1200       6       6

In [66]:
df.drop('Number', axis= 1,inplace = True)

In [67]:
df

  Employee_Company employee_id  Salary
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

## Miscellaneous

In [50]:
df['Employee_Company'].unique()

array(['GOOGLE', 'MICROSOFT', 'FACEBOOK'], dtype=object)

In [51]:
df['Employee_Company'].nunique()

3

In [52]:
df['Employee_Company'].count()

6

In [53]:
df.groupby('Employee_Company').count()

                  employee_id  Salary
Employee_Company
FACEBOOK                    2       2
GOOGLE                      2       2
MICROSOFT                   2       2

In [56]:
df['Employee_Company'].value_counts()

MICROSOFT    2
FACEBOOK     2
GOOGLE       2
Name: Employee_Company, dtype: int64

In [58]:
def times2(value):                  #function
    return value*2

In [59]:
df['Salary'].apply(times2)

0     9000
1    11000
2    13000
3     6800
4     4600
5     2400
Name: Salary, dtype: int64

In [60]:
df['Salary'].apply(lambda x: x*2)        #lambda function

0     9000
1    11000
2    13000
3     6800
4     4600
5     2400
Name: Salary, dtype: int64

In [61]:
df['Employee_Company'].apply(len)

0    6
1    6
2    9
3    9
4    8
5    8
Name: Employee_Company, dtype: int64

In [68]:
df.apply(len)

Employee_Company    6
employee_id         6
Salary              6
dtype: int64

In [69]:
df.sort_values('Salary', ascending= False)

  Employee_Company employee_id  Salary
2        MICROSOFT          P3    6500
1           GOOGLE          P2    5500
0           GOOGLE          P1    4500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

In [70]:
df.drop(5)

  Employee_Company employee_id  Salary
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300

In [71]:
df.columns

Index(['Employee_Company', 'employee_id', 'Salary'], dtype='object')

In [72]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [73]:
df

  Employee_Company employee_id  Salary
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

# Reading a csv File

In [74]:
df1 = pd.read_csv('titanic_train.csv')

In [75]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [76]:
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [77]:
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [78]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB